testcases/pipe_potential/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0;

boundaryField
{
    perim
    {
        type uniformFixedValue;
        uniformValue table
        (
(0.0 -0.0)
(2e-05 -2.307396470339075e-05)
(4e-05 -4.61479294067815e-05)
(6.000000000000001e-05 -6.922189411017225e-05)
(8e-05 -9.2295858813563e-05)
(0.0001 -0.00011536982351695375)
(0.00012000000000000002 -0.0001384437882203445)
(0.00014000000000000001 -0.00016151775292373523)
(0.00016 -0.000184591717627126)
(0.00018 -0.00020766568233051674)
(0.0002 -0.0002307396470339075)
(0.00022 -0.00025381361173729827)
(0.00024000000000000003 -0.000276887576440689)
(0.00026000000000000003 -0.00029996154114407975)
(0.00028000000000000003 -0.00032303550584747046)
(0.00030000000000000003 -0.0003461094705508613)
(0.00032 -0.000369183435254252)
(0.00034 -0.0003922573999576427)
(0.00036 -0.0004153313646610335)
(0.00038 -0.0004384053293644242)
(0.0004 -0.000461479294067815)
(0.00042 -0.0004845532587712057)
(0.00044 -0.0005076272234745965)
(0.00046 -0.0005307011881779873)
(0.00048000000000000007 -0.000553775152881378)
(0.0005 -0.0005768491175847687)
(0.0005200000000000001 -0.0005999230822881595)
(0.00054 -0.0006229970469915502)
(0.0005600000000000001 -0.0006460710116949409)
(0.00058 -0.0006691449763983316)
(0.0006000000000000001 -0.0006922189411017226)
(0.00062 -0.0007152929058051133)
(0.00064 -0.000738366870508504)
(0.0006600000000000001 -0.0007614408352118947)
(0.00068 -0.0007845147999152854)
(0.0007000000000000001 -0.0008075887646186762)
(0.00072 -0.000830662729322067)
(0.0007400000000000001 -0.0008537366940254577)
(0.00076 -0.0008768106587288484)
(0.0007800000000000001 -0.0008998846234322393)
(0.0008 -0.00092295858813563)
(0.0008200000000000001 -0.0009460325528390207)
(0.00084 -0.0009691065175424114)
(0.0008600000000000001 -0.0009921804822458022)
(0.00088 -0.001015254446949193)
(0.0009000000000000001 -0.0010383284116525838)
(0.00092 -0.0010614023763559745)
(0.0009400000000000001 -0.0010844763410593652)
(0.0009600000000000001 -0.001107550305762756)
(0.0009800000000000002 -0.0011306242704661467)
(0.001 -0.0011536982351695374)
(0.00102 -0.001176772199872928)
(0.0010400000000000001 -0.001199846164576319)
(0.0010600000000000002 -0.0012229201292797097)
(0.00108 -0.0012459940939831004)
(0.0011 -0.0012690680586864911)
(0.0011200000000000001 -0.0012921420233898819)
(0.0011400000000000002 -0.0013152159880932728)
(0.00116 -0.0013382899527966633)
(0.00118 -0.0013613639175000542)
(0.0012000000000000001 -0.0013844378822034451)
(0.0012200000000000002 -0.0014075118469068356)
(0.00124 -0.0014305858116102266)
(0.00126 -0.001453659776313617)
(0.00128 -0.001476733741017008)
(0.0013000000000000002 -0.0014998077057203987)
(0.0013200000000000002 -0.0015228816704237894)
(0.00134 -0.0015459556351271803)
(0.00136 -0.0015690295998305708)
(0.0013800000000000002 -0.0015921035645339618)
(0.0014000000000000002 -0.0016151775292373525)
(0.00142 -0.0016382514939407432)
(0.00144 -0.001661325458644134)
(0.0014600000000000001 -0.0016843994233475246)
(0.0014800000000000002 -0.0017074733880509153)
(0.0015 -0.0017305473527543063)
(0.00152 -0.0017536213174576968)
(0.0015400000000000001 -0.0017766952821610877)
(0.0015600000000000002 -0.0017997692468644786)
(0.00158 -0.0018228432115678691)
(0.0016 -0.00184591717627126)
(0.0016200000000000001 -0.0018689911409746505)
(0.0016400000000000002 -0.0018920651056780415)
(0.0016600000000000002 -0.0019151390703814324)
(0.00168 -0.001938213035084823)
(0.0017000000000000001 -0.0019612869997882136)
(0.0017200000000000002 -0.0019843609644916043)
(0.0017400000000000002 -0.002007434929194995)
(0.00176 -0.002030508893898386)
(0.0017800000000000001 -0.0020535828586017765)
(0.0018000000000000002 -0.0020766568233051676)
(0.0018200000000000002 -0.002099730788008558)
(0.00184 -0.002122804752711949)
(0.00186 -0.0021458787174153397)
(0.0018800000000000002 -0.0021689526821187305)
(0.0019000000000000002 -0.002192026646822121)
(0.0019200000000000003 -0.002215100611525512)
(0.00194 -0.0022381745762289026)
(0.0019600000000000004 -0.0022612485409322933)
...
(0.9999600000000001 -1.1536520872401306)

        );
        
    }

        bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
