testcases/pipe_potential/0/n1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      n1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0.5;


boundaryField
{
    perim
    {
        type uniformFixedValue;
        uniformValue table
        (
(0.0 0.5)
(2e-05 0.5000115371154547)
(4e-05 0.5000230744971195)
(6.000000000000001e-05 0.5000346121450003)
(8e-05 0.5000461500591037)
(0.0001 0.5000576882394355)
(0.00012000000000000002 0.500069226686002)
(0.00014000000000000001 0.5000807653988092)
(0.00016 0.5000923043778633)
(0.00018 0.5001038436231705)
(0.0002 0.5001153831347369)
(0.00022 0.5001269229125687)
(0.00024000000000000003 0.500138462956672)
(0.00026000000000000003 0.5001500032670528)
(0.00028000000000000003 0.5001615438437176)
(0.00030000000000000003 0.5001730846866722)
(0.00032 0.5001846257959229)
(0.00034 0.5001961671714759)
(0.00036 0.5002077088133371)
(0.00038 0.500219250721513)
(0.0004 0.5002307928960094)
(0.00042 0.5002423353368327)
(0.00044 0.5002538780439889)
(0.00046 0.5002654210174842)
(0.00048000000000000007 0.5002769642573247)
(0.0005 0.5002885077635166)
(0.0005200000000000001 0.500300051536066)
(0.00054 0.5003115955749792)
(0.0005600000000000001 0.5003231398802621)
(0.00058 0.500334684451921)
(0.0006000000000000001 0.500346229289962)
(0.00062 0.5003577743943912)
(0.00064 0.5003693197652149)
(0.0006600000000000001 0.5003808654024391)
(0.00068 0.50039241130607)
(0.0007000000000000001 0.5004039574761138)
(0.00072 0.5004155039125766)
(0.0007400000000000001 0.5004270506154644)
(0.00076 0.5004385975847837)
(0.0007800000000000001 0.5004501448205403)
(0.0008 0.5004616923227405)
(0.0008200000000000001 0.5004732400913905)
(0.00084 0.5004847881264963)
(0.0008600000000000001 0.5004963364280641)
(0.00088 0.5005078849961002)
(0.0009000000000000001 0.5005194338306105)
(0.00092 0.5005309829316014)
(0.0009400000000000001 0.5005425322990789)
(0.0009600000000000001 0.5005540819330491)
(0.0009800000000000002 0.5005656318335182)
(0.001 0.5005771820004924)
(0.00102 0.5005887324339778)
(0.0010400000000000001 0.5006002831339806)
(0.0010600000000000002 0.5006118341005069)
(0.00108 0.500623385333563)
(0.0011 0.5006349368331547)
(0.0011200000000000001 0.5006464885992885)
(0.0011400000000000002 0.5006580406319705)
(0.00116 0.5006695929312066)
(0.00118 0.5006811454970033)
(0.0012000000000000001 0.5006926983293664)
(0.0012200000000000002 0.5007042514283022)
(0.00124 0.500715804793817)
(0.00126 0.5007273584259168)
(0.00128 0.5007389123246078)
(0.0013000000000000002 0.5007504664898961)
(0.0013200000000000002 0.5007620209217878)
(0.00134 0.5007735756202891)
(0.00136 0.5007851305854063)
(0.0013800000000000002 0.5007966858171454)
(0.0014000000000000002 0.5008082413155126)
(0.00142 0.500819797080514)
(0.00144 0.5008313531121559)
(0.0014600000000000001 0.5008429094104442)
(0.0014800000000000002 0.5008544659753853)
(0.0015 0.5008660228069852)
(0.00152 0.5008775799052501)
(0.0015400000000000001 0.5008891372701861)
(0.0015600000000000002 0.5009006949017996)
(0.00158 0.5009122528000963)
(0.0016 0.5009238109650828)
(0.0016200000000000001 0.500935369396765)
(0.0016400000000000002 0.5009469280951491)
(0.0016600000000000002 0.5009584870602413)
(0.00168 0.5009700462920478)
(0.0017000000000000001 0.5009816057905746)
(0.0017200000000000002 0.500993165555828)
(0.0017400000000000002 0.501004725587814)
(0.00176 0.5010162858865389)
(0.0017800000000000001 0.5010278464520087)
(0.0018000000000000002 0.5010394072842298)
(0.0018200000000000002 0.5010509683832082)
(0.00184 0.50106252974895)
(0.00186 0.5010740913814614)
(0.0018800000000000002 0.5010856532807487)
(0.0019000000000000002 0.5010972154468178)
(0.0019200000000000003 0.5011087778796751)
(0.00194 0.5011203405793266)
(0.0019600000000000004 0.5011319035457785)
...
        );
        
    }



    bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
