testcases/pipe_potential/0/n2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      n2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0.5;

boundaryField
{

    perim
    {
        type uniformFixedValue;
        uniformValue table
        (
(0.0 0.5)
(2e-05 0.49998846315074924)
(4e-05 0.49997692656769627)
(6.000000000000001e-05 0.4999653902508349)
(8e-05 0.4999538542001591)
(0.0001 0.4999423184156626)
(0.00012000000000000002 0.4999307828973393)
(0.00014000000000000001 0.49991924764518314)
(0.00016 0.4999077126591879)
(0.00018 0.4998961779393474)
(0.0002 0.49988464348565553)
(0.00022 0.49987310929810624)
(0.00024000000000000003 0.4998615753766933)
(0.00026000000000000003 0.49985004172141045)
(0.00028000000000000003 0.4998385083322519)
(0.00030000000000000003 0.49982697520921116)
(0.00032 0.49981544235228226)
(0.00034 0.499803909761459)
(0.00036 0.4997923774367353)
(0.00038 0.499780845378105)
(0.0004 0.499769313585562)
(0.00042 0.49975778205909993)
(0.00044 0.49974625079871293)
(0.00046 0.4997347198043947)
(0.00048000000000000007 0.4997231890761392)
(0.0005 0.4997116586139403)
(0.0005200000000000001 0.49970012841779177)
(0.00054 0.49968859848768743)
(0.0005600000000000001 0.4996770688236213)
(0.00058 0.49966553942558706)
(0.0006000000000000001 0.4996540102935788)
(0.00062 0.4996424814275902)
(0.00064 0.4996309528276152)
(0.0006600000000000001 0.4996194244936477)
(0.00068 0.4996078964256813)
(0.0007000000000000001 0.49959636862371026)
(0.00072 0.4995848410877282)
(0.0007400000000000001 0.499573313817729)
(0.00076 0.4995617868137066)
(0.0007800000000000001 0.4995502600756548)
(0.0008 0.49953873360356743)
(0.0008200000000000001 0.49952720739743844)
(0.00084 0.49951568145726166)
(0.0008600000000000001 0.4995041557830309)
(0.00088 0.4994926303747401)
(0.0009000000000000001 0.49948110523238315)
(0.00092 0.4994695803559538)
(0.0009400000000000001 0.499458055745446)
(0.0009600000000000001 0.4994465314008536)
(0.0009800000000000002 0.4994350073221704)
(0.001 0.4994234835093903)
(0.00102 0.49941195996250726)
(0.0010400000000000001 0.49940043668151507)
(0.0010600000000000002 0.49938891366640753)
(0.00108 0.4993773909171786)
(0.0011 0.4993658684338221)
(0.0011200000000000001 0.4993543462163319)
(0.0011400000000000002 0.4993428242647019)
(0.00116 0.4993313025789259)
(0.00118 0.49931978115899783)
(0.0012000000000000001 0.4993082600049115)
(0.0012200000000000002 0.49929673911666084)
(0.00124 0.4992852184942397)
(0.00126 0.49927369813764183)
(0.00128 0.49926217804686135)
(0.0013000000000000002 0.49925065822189185)
(0.0013200000000000002 0.4992391386627274)
(0.00134 0.49922761936936166)
(0.00136 0.49921610034178876)
(0.0013800000000000002 0.49920458158000236)
(0.0014000000000000002 0.4991930630839964)
(0.00142 0.49918154485376476)
(0.00144 0.49917002688930123)
(0.0014600000000000001 0.49915850919059984)
(0.0014800000000000002 0.4991469917576543)
(0.0015 0.4991354745904586)
(0.00152 0.49912395768900647)
(0.0015400000000000001 0.49911244105329194)
(0.0015600000000000002 0.49910092468330863)
(0.00158 0.49908940857905065)
(0.0016 0.49907789274051184)
(0.0016200000000000001 0.499066377167686)
(0.0016400000000000002 0.49905486186056697)
(0.0016600000000000002 0.49904334681914864)
(0.00168 0.499031832043425)
(0.0017000000000000001 0.49902031753338977)
(0.0017200000000000002 0.49900880328903685)
(0.0017400000000000002 0.49899728931036014)
(0.00176 0.49898577559735346)
(0.0017800000000000001 0.49897426215001084)
(0.0018000000000000002 0.498962748968326)
(0.0018200000000000002 0.4989512360522928)
(0.00184 0.4989397234019052)
(0.00186 0.498928211017157)
(0.0018800000000000002 0.4989166988980421)
(0.0019000000000000002 0.49890518704455433)
(0.0019200000000000003 0.4988936754566876)
(0.00194 0.4988821641344358)
(0.0019600000000000004 0.49887065307779277)
...
        );
        
    }


    bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
